first_routes/app/controllers/ArtworksController.rb

    def index
        # render plain: "I'm in the index action!"

      # render json: Artwork.find(params[:id])
      # debugger
      if params[:user_id]
        artist = User.find(params[:user_id])
        render json: artist.artworks
      else
        render json: Artwork.all
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
SELECT "artworks".* FROM "artworks"