first_routes/app/controllers/UsersController.rb

  def index
    # render plain: "I'm in the index action!"

  # render json: Artwork.find(params[:id])
  # debugger
  if params[:artwork_id]
    art = Artwork.find(params[:artwork_id])
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]